In [1]:
import pandas as pd
import glob
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import os

In [2]:
pwd

'C:\\Users\\preethi'

In [3]:
stud_list= pd.read_csv('C:\\Users\\preethi\\.ipynb_checkpoints\\studentlist.csv')
print(stud_list.shape)

#sorted_studentlist = df.sort_values(by='studentname')
stud_list.head()

(1017, 4)

   enrollmentnumber          admn     studentname  studentEmail
0        1613101016  16SCSE101757   AAYUSH  TYAGI           NaN
1        1613101026  16SCSE101415        ABHISHEK           NaN
2        1613101051  16SCSE101222    ADITI  SINGH           NaN
3        1613101054  16SCSE101220  ADITYA  MANKAR           NaN
4        1613101079  16SCSE101085   AKASH  KANSAL           NaN

### READ BATCHWISE LIST

In [4]:
path = 'C:\\Users\\preethi\\.ipynb_checkpoints\\batchwiselist'
read_files = glob.glob(os.path.join(path,'*.csv'))
np_array_values = []
for i in read_files:
    batches = pd.read_csv(i)
    np_array_values.append(batches)

total_list = pd.concat(np_array_values)
print(total_list.shape)

(1017, 5)

### READING QUIZ FILE

In [5]:
path = 'C:\\Users\\preethi\\.ipynb_checkpoints\\quiz'
read_files = glob.glob(os.path.join(path,'*.csv'))
quiz = []
for i in read_files:
    files = pd.read_csv(i)
    quiz.append(files)
    
#defining csv of quiz 1 and quiz 2
quiz1 = quiz[0]
quiz2 = quiz[1]

#merging the files
bth_quiz = pd.concat(quiz)
bth_quiz.head()
quiz1.drop(columns=['ID number','Institution','Department','Email address'],inplace = True)
quiz2.drop(columns=['ID number','Institution','Department','Email address'],inplace = True)

In [6]:
print(quiz1.shape)
quiz1.head(3)

(660, 7)

,Surname,Firstname,State,Started on,Completed,Time taken,Grade/10.00
0,16BTCSES11,SIDDHANT GUPTA,Finished,08-02-2019 09:57,08-02-2019 10:11,14 mins 1 sec,4
1,16BTCSES11,ARPIT SHARMA,Finished,08-02-2019 09:57,08-02-2019 10:11,14 mins 5 secs,5
2,16BTCSES11,VISHAL SINGH,Finished,08-02-2019 09:57,14-02-2019 10:10,6 days,7

In [7]:
statistic_df = pd.DataFrame(columns = ["noofpresent", "lessthan50", "between50and60", 
                                       "between60and70", "between70and80", "greaterthan80"],
                                        index = ['Quiz1','Quiz2'])
statistic_df

,noofpresent,lessthan50,between50and60,between60and70,between70and80,greaterthan80
Quiz1,NaN,NaN,NaN,NaN,NaN,NaN
Quiz2,NaN,NaN,NaN,NaN,NaN,NaN

In [8]:
quiz1['Firstname'] = quiz1['Firstname'].dropna()
quiz2['Firstname'] = quiz2['Firstname'].dropna()

In [10]:
quiz1['Grade/10.00'].unique()

array(['4', '5', '7', '9', '1', '6', '8', '10', '3', '2', '0', '-', '7.4'],
      dtype=object)

In [11]:
quiz1["Grade/10.00"] = quiz1["Grade/10.00"].str.replace('-','0')
quiz2["Grade/10.00"] = quiz2["Grade/10.00"].str.replace('-','0')

In [12]:
quiz1["Grade/10.00"] = quiz1["Grade/10.00"].apply(pd.to_numeric)
quiz2["Grade/10.00"] = quiz2["Grade/10.00"].apply(pd.to_numeric)

In [15]:
type(quiz1['Grade/10.00'][0])

numpy.float64

In [17]:
quiz1[quiz1['Grade/10.00'] < 5]['Firstname'].count()   # 127
quiz2[quiz2['Grade/10.00'] < 5]['Firstname'].count()    #93

93

In [18]:
quiz1.count()

Surname        660
Firstname      659
State          659
Started on     659
Completed      659
Time taken     659
Grade/10.00    660
dtype: int64

In [19]:
statistic_df['noofpresent'] = [quiz1['Firstname'].count(),quiz2['Firstname'].count()]
statistic_df['lessthan50'] = [quiz1[quiz1['Grade/10.00'].between(0,4.9, inclusive=True)]['Firstname'].count(),
                               quiz2[quiz2['Grade/10.00'].between(0,4.9)]['Firstname'].count()]
statistic_df['between50and60'] = [quiz1[quiz1['Grade/10.00'].between(5,5.9,inclusive = True)]['Firstname'].count(),
                                 quiz2[quiz2['Grade/10.00'].between(5,5.9)]['Firstname'].count()]
statistic_df['between60and70'] = [quiz1[quiz1['Grade/10.00'].between(6,6.9,inclusive = True)]['Firstname'].count(),
                                 quiz2[quiz2['Grade/10.00'].between(6,6.9)]['Firstname'].count()]
statistic_df['between70and80'] = [quiz1[quiz1['Grade/10.00'].between(7,7.9,inclusive = True)]['Firstname'].count(),
                                 quiz2[quiz2['Grade/10.00'].between(7,7.9)]['Firstname'].count()]
statistic_df['greaterthan80'] = [quiz1[quiz1['Grade/10.00'].between(8,10,inclusive = True)]['Firstname'].count(),
                                quiz2[quiz2['Grade/10.00'].between(8,10)]['Firstname'].count()]

In [20]:
statistic_df

,noofpresent,lessthan50,between50and60,between60and70,between70and80,greaterthan80
Quiz1,659,127,69,57,58,348
Quiz2,680,93,40,39,41,467

In [38]:
path = 'C:\\Users\\preethi\\.ipynb_checkpoints\\batchwiselist'
read_files = glob.glob(os.path.join(path,'*.csv'))
print(read_files[0])

file = []

for i in read_files:
    df = pd.read_csv(i)
    file.append(df)
#print(file[0])

C:\Users\preethi\.ipynb_checkpoints\batchwiselist\1.csv

In [27]:
quiz_1 = pd.merge(quiz1, stud_list , left_on='Firstname',right_on = 'studentname',how='right' )
quiz_2 = pd.merge(quiz2 , stud_list , left_on = 'Firstname', right_on = 'studentname',  how = 'right')
print(quiz_1.shape)
print(quiz_2.shape)

(1017, 11)
(1017, 11)

In [43]:
quiz_1.head(2)

,Surname,Firstname,State,Started on,Completed,Time taken,Grade/10.00,enrollmentnumber,admn,studentname,studentEmail
0,16BTCSES11,SIDDHANT GUPTA,Finished,08-02-2019 09:57,08-02-2019 10:11,14 mins 1 sec,4.0,1613101735,16SCSE101546,SIDDHANT GUPTA,NaN
1,16BTCSES11,ARPIT SHARMA,Finished,08-02-2019 09:57,08-02-2019 10:11,14 mins 5 secs,5.0,1613101180,16SCSE101043,ARPIT SHARMA,NaN

In [31]:
quiz_1['Grade/10.00'].unique()

array([ 4.,  5.,  7.,  9.,  1.,  6.,  8., 10.,  3.,  2.,  0., nan])

In [32]:
quiz_2['Grade/10.00'].unique()

array([ 4., 10.,  3.,  9.,  0.,  5.,  7.,  6.,  2.,  1.,  8., nan])

In [33]:
quiz_1['Grade/10.00'] = quiz_1['Grade/10.00'].fillna(0)
quiz_2['Grade/10.00'] = quiz_2['Grade/10.00'].fillna(0)

In [49]:
print(quiz_1['studentname'].count())
print(file[0]['studentName'].count())

1017
63

In [54]:
n = 18    #there are 18 csv files in batchwise folder
batch_quiz1 = []
for i in range(n+1):
    quizz = pd.merge(file[i] , quiz_1 , left_on = 'studentName', right_on = 'studentname' ,how = 'left' )
    batch_quiz1.append(quizz)
    
print(batch_quiz1[0].shape)
batch_quiz1[0].head(3)

batch_quiz2 = []
for i in range(n+1):
    quizz = pd.merge(file[i] , quiz_2 , left_on = 'studentName' , right_on = 'studentname' , how='left')
    batch_quiz2.append(quizz)
    
print(batch_quiz2[0].shape)
batch_quiz2[0].head(3)

(63, 16)
(63, 16)

,Unnamed: 0,srNo,enrollmentNumber,admissionNumber,studentName,Surname,Firstname,State,Started on,Completed,Time taken,Grade/10.00,enrollmentnumber,admn,studentname,studentEmail
0,0,1,1613101016,16SCSE101757,AAYUSH TYAGI,16BTCSES1,AAYUSH TYAGI,Finished,12-03-2019 14:50,12-03-2019 14:54,3 mins 11 secs,10.0,1613101016,16SCSE101757,AAYUSH TYAGI,NaN
1,1,2,1613101026,16SCSE101415,ABHISHEK,16BTCSES1,ABHISHEK,Finished,12-03-2019 14:48,12-03-2019 15:06,17 mins 58 secs,10.0,1613101026,16SCSE101415,ABHISHEK,NaN
2,2,3,1613101051,16SCSE101222,ADITI SINGH,16BTCSES1,ADITI SINGH,Finished,12-03-2019 14:49,12-03-2019 15:03,13 mins 35 secs,9.0,1613101051,16SCSE101222,ADITI SINGH,NaN

In [55]:
final = pd.DataFrame(columns = ["noofpresent", "lessthan50", "between50and60", 
                                "between60and70", "between70and80", "greaterthan80"],
                                index = ['Quiz_1','Quiz_2'])
final

,noofpresent,lessthan50,between50and60,between60and70,between70and80,greaterthan80
Quiz_1,NaN,NaN,NaN,NaN,NaN,NaN
Quiz_2,NaN,NaN,NaN,NaN,NaN,NaN

In [56]:
batch_quiz1[0].head(2)

,Unnamed: 0,srNo,enrollmentNumber,admissionNumber,studentName,Surname,Firstname,State,Started on,Completed,Time taken,Grade/10.00,enrollmentnumber,admn,studentname,studentEmail
0,0,1,1613101016,16SCSE101757,AAYUSH TYAGI,16BTCSES1,AAYUSH TYAGI,Finished,08-02-2019 15:59,08-02-2019 16:06,7 mins 14 secs,5.0,1613101016,16SCSE101757,AAYUSH TYAGI,NaN
1,1,2,1613101026,16SCSE101415,ABHISHEK,16BTCSES1,ABHISHEK,Finished,08-02-2019 16:06,08-02-2019 16:22,15 mins 41 secs,7.0,1613101026,16SCSE101415,ABHISHEK,NaN

In [57]:
batch_quiz2[0].head(2)

,Unnamed: 0,srNo,enrollmentNumber,admissionNumber,studentName,Surname,Firstname,State,Started on,Completed,Time taken,Grade/10.00,enrollmentnumber,admn,studentname,studentEmail
0,0,1,1613101016,16SCSE101757,AAYUSH TYAGI,16BTCSES1,AAYUSH TYAGI,Finished,12-03-2019 14:50,12-03-2019 14:54,3 mins 11 secs,10.0,1613101016,16SCSE101757,AAYUSH TYAGI,NaN
1,1,2,1613101026,16SCSE101415,ABHISHEK,16BTCSES1,ABHISHEK,Finished,12-03-2019 14:48,12-03-2019 15:06,17 mins 58 secs,10.0,1613101026,16SCSE101415,ABHISHEK,NaN

In [70]:
result = []
for i in range(n+1):
    final['noofpresent'] = [batch_quiz1[i]['studentname'].count() , batch_quiz2[i]['studentName'].count()]
    final['lessthan50'] =[batch_quiz1[i][batch_quiz1[i]['Grade/10.00'].between(0,4.9,inclusive = True)]['studentName'].count() ,
                          batch_quiz2[i][batch_quiz2[i]['Grade/10.00'].between(0,4.9,inclusive = True)]['studentName'].count()]
    final['between50and60'] = [batch_quiz1[i][batch_quiz1[i]['Grade/10.00'].between(5,5.9, inclusive = True)]['studentName'].count(),
                              batch_quiz2[i][batch_quiz2[i]['Grade/10.00'].between(5,5.9 , inclusive = True)]['studentName'].count()]
    final['between60and70'] = [batch_quiz1[i][batch_quiz1[i]['Grade/10.00'].between(6,6.9, inclusive = True)]['studentName'].count(),
                              batch_quiz2[i][batch_quiz2[i]['Grade/10.00'].between(6,6.9 , inclusive = True)]['studentName'].count()]
    final['between70and80'] = [batch_quiz1[i][batch_quiz1[i]['Grade/10.00'].between(7,7.9, inclusive = True)]['studentName'].count(),
                              batch_quiz2[i][batch_quiz2[i]['Grade/10.00'].between(7,7.9 , inclusive = True)]['studentName'].count()]
    final['greaterthan80'] =  [batch_quiz1[i][batch_quiz1[i]['Grade/10.00'].between(8,10, inclusive = True)]['studentName'].count(),
                              batch_quiz2[i][batch_quiz2[i]['Grade/10.00'].between(8,10 , inclusive = True)]['studentName'].count()]
    result.append(final)    
result[0]

,noofpresent,lessthan50,between50and60,between60and70,between70and80,greaterthan80
Quiz_1,39,23,3,0,4,9
Quiz_2,39,29,2,1,2,5

In [75]:
txt = pd.read_csv('C:\\Users\\preethi\\.ipynb_checkpoints\\testcaseStudent.txt',header = None ,names = ['inputs'] )
txt

          inputs
0              2
1          1.csv
2  greaterthan80
3          9.csv
4     lessthan50

In [76]:
test_case = int(txt.iloc[0,0])
test_case

2

In [77]:
lst = []
for i in range(test_case*2+1):
    print(i)
    lst.append(i)
print(lst)

0
1
2
3
4
[0, 1, 2, 3, 4]

In [78]:
file_name = lst[1::2]
column = lst[2::2]
print(file_name)
print(column)

[1, 3]
[2, 4]

In [88]:
v = []
for i in file_name:
    x = txt.iloc[i,0]
    print(x)
    y = int(x[0])
    print(y)
    v.append(y)
#sub -1 to match index
a = [i - 1 for i in v]
print(f'a = {a}')

c = []
for i in column:
    x = txt.iloc[i,0]
    print(x)
    c.append(x)

print(f'v= {v}')
print(f'c = {c}')

1.csv
1
9.csv
9
a = [0, 8]
greaterthan80
lessthan50
v= [1, 9]
c = ['greaterthan80', 'lessthan50']

In [92]:
for (x,y) in zip(a,c):
    print(x,y)
    print(result[x][y])
    print([x])

0 greaterthan80
Quiz_1    9
Quiz_2    5
Name: greaterthan80, dtype: int64
[0]
8 lessthan50
Quiz_1    23
Quiz_2    29
Name: lessthan50, dtype: int64
[8]